MathDaw/SMWM_STM32/Core/Src/main.c
		sprintf(str, "Aktywuj");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);

		last_state = current_state;
	}

	// Odczyt gestu flick

	flick_interaction_t interaction=flick_get_interaction(gesture,touch,airwheel);

	// Przejście do odpowiedniego stanu

//	if(interaction == FLICK_NO_INTERACTION)
//	{
//		BSP_LCD_Clear(LCD_COLOR_YELLOW);
//		HAL_Delay(500);
//	}

	if(interaction == FLICK_TOUCH_LEWO)
	{
		current_state = ST_EDIT;
	}
	if(interaction == FLICK_TOUCH_PRAWO)
	{
		current_state = ST_SPEED;
	}
	if(interaction == FLICK_TOUCH_DOL)
	{
		current_state = select_mode;
	}
}
void StAzimuth(void)
{
	char str[40];
	uint8_t angle = 0;
	uint8_t last_angle = 0;

	// dodać odczyt z magnetometru
	//wywolanie funkcji kierunek
	angle = kierunek_kompas(&hi2c2);	//0-255

	//sprintf(str, "%u  ", kierunek);
	//BSP_LCD_DisplayStringAtLine(7, (uint8_t *) str);

	flick_poll_data(&gesture, &touch, &airwheel);

	if(current_state != last_state)
	{
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "Utrzymanie azymutu");
		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);
		BSP_LCD_DisplayStringAt(0, 20, "N", CENTER_MODE);

		sprintf(str, "Powrot do MENU");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		last_state = current_state;
	}

	//uint8_t set_angle_1 = 3.14/3;	// kat testowy
	if (set_angle_1 != angle)
	{
		LCD_PrintDirection(set_angle_1, set_angle_1, 64, 80, 50, LCD_COLOR_BLACK); // zadany azymut
	}

	//angle = 3.14/4;	// kat testowy
	LCD_PrintDirection(angle, last_angle, 64, 80, 50, LCD_COLOR_RED); //aktualny azymut

	last_angle = angle;

	// dodać sterowanie silnikiem

	uint8_t set_position = angle - set_angle_1;
	if(!stepper.is_working)
	{
		stepper_set_destination(&stepper,set_position,2);
		stepper_proceed(&stepper);
	}

	// Przejść do stanu Menu
	flick_interaction_t interaction = flick_get_interaction(gesture,touch,airwheel);

	if(interaction == FLICK_TOUCH_SRODEK)
	{
		current_state = ST_MENU;
	}
}
void StRange(void)
{
	char str[40];

	uint8_t angle;
	uint8_t last_angle = 0;

	angle = kierunek_kompas(&hi2c2);	//0-255

	// dodać odczyt z magnetometru

	flick_poll_data(&gesture, &touch, &airwheel);
	if(current_state != last_state)
	{
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "Zakres");
		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

		sprintf(str, "Powrot do MENU");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		last_state = current_state;
	}

	//angle = 0;	// kat testowy
	LCD_PrintDirection(angle, last_angle, 64, 80, 50, LCD_COLOR_RED); //aktualny azymut

	//dodać zadany przez użytkownika dolny ogranicznik
	//uint8_t set_angle_1 = 0;	// kat testowy
	if (set_angle_1 != angle)
	{
		LCD_PrintDirection(set_angle_1, set_angle_1, 64, 80, 50, LCD_COLOR_BLACK); //ogranicznik 1
	}
	//dodać zadany przez użytkownika gorny ogranicznik
	//uint8_t set_angle_2 = 0;	// kat testowy

	if (set_angle_2 != angle)
	{
		LCD_PrintDirection(set_angle_2, set_angle_2, 64, 80, 50, LCD_COLOR_BLACK); // ogranicznik 2
	}

	//dodać sterowanie silnikiem
	uint8_t set_angle = set_angle_1;
	if(set_angle_1 == angle) angle = set_angle_2;
	if(set_angle_2 == angle) angle = set_angle_1;
	uint8_t set_position = angle - set_angle;

	if(!stepper.is_working)
	{
		stepper_set_destination(&stepper,set_position,2);
		stepper_proceed(&stepper);
	}

	// Przejść do stanu Menu
	flick_interaction_t interaction = flick_get_interaction(gesture,touch,airwheel);

	if(interaction == FLICK_TOUCH_SRODEK)
	{
		current_state = ST_MENU;
	}
}
void StEdit (void)
{
	char str[40];

	flick_poll_data(&gesture, &touch, &airwheel);
	if(current_state != last_state)
	{
		opt = 0;
		last_opt = 1;
	}
	switch (opt)
	{
	case 0:
		if(last_opt != opt)
		{
			BSP_LCD_Clear(LCD_COLOR_WHITE);
			sprintf(str, "Wybierz tryb");
			BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

			sprintf(str, "Zatwierdz");
			BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		}

		uint8_t tmp = 0;
		flick_set_value(&tmp, ST_AZIMUTH*10, ST_RANGE*10);
		select_mode = tmp/10;

		if(select_mode == ST_AZIMUTH)
		{
			sprintf(str, "     Azymut    ");
			BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);
		}
		if(select_mode == ST_RANGE)
		{
			sprintf(str, "     Zakres     ");
			BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);
		}
		last_opt = opt;
		break;

	case 1:
		if(last_opt != opt)
		{
			BSP_LCD_Clear(LCD_COLOR_WHITE);
			sprintf(str, "Podaj dolna wartosc ograniczajaca");
			BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

			sprintf(str, "Zatwierdz");
			BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		}

		flick_set_value(&set_angle_1, 0, 360);

		sprintf(str, "   %02x   ", set_angle_1);
		BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);

		last_opt = opt;
		break;

	case 2:
		if(select_mode == ST_RANGE)
		{
			if(last_opt != opt)
			{
				BSP_LCD_Clear(LCD_COLOR_WHITE);
				sprintf(str, "Podaj gorna wartosc ograniczajaca");
				BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

				sprintf(str, "Zatwierdz");
				BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
			}

			flick_set_value(&set_angle_2, 0, 360);

			sprintf(str, "   %02x   ", set_angle_2);
			BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);

			last_opt = opt;
		}
		else opt++;
		break;

	default:
		current_state = ST_MENU;
		break;
	}

	// odczyt z flick

//	if(select_mode == ST_RANGE)
//	{
//		BSP_LCD_Clear(LCD_COLOR_WHITE);
//		sprintf(str, "Podaj gorna wartosc ograniczajaca");
//		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);
//
//		sprintf(str, "   %02x   ", set_angle_2);
//		BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);
//	}

	// odczyt z flick

	// przejscie do kolejnej opcji
	flick_interaction_t interaction = flick_get_interaction(gesture,touch,airwheel);
	if(interaction == FLICK_TOUCH_SRODEK)
	{
		opt++;
	}
}
void StSpeed (void)
{
	char str[40];
	flick_poll_data(&gesture, &touch, &airwheel);
	if(current_state != last_state)
	{
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "Podaj prędkosc silnika");
		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

